from main import PLAYERS
# Заготовка на будущее для импортирования ботов с разной сложностью игры
# from easy_mode import bot1 (bot1 - easy mode)
# from hard_mode import bot2 (bot2 - hard mode)

# ИСПРАВИТЬ: согласно документации, функция должна именно запрашивать уровень сложности, а не принимать его в качестве параметра
def get_difficultly_level(level):
    """Запрашивает у пользователя уровень сложности для игры с ботом."""
    if level == 'easy':
        # bot1()
        # ИСПОЛЬЗОВАТЬ: с ключевым словом pass вы сможете создавать пустые заготовки блоков и при этом любым образом использовать все нужные вам файлы
        pass
    if level == 'hard':
        # bot2()
        pass
